# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'tree' # List directories in a tree structure
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'svn'

# Development
brew 'node'

# Apps
cask 'alfred'
cask 'adobe-creative-cloud'
cask 'anki'
cask 'appcleaner'
cask 'authy'
cask 'bitwarden'
cask 'clip-studio-paint'
cask 'cloudflare-warp'
cask 'cryptomator'
cask 'discord'
cask 'figma'
cask 'firefox'
cask 'flux'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-drive-file-stream'
cask 'google-chrome'
cask 'inky'
cask 'jetbrains-toolbox'
cask 'kite'
cask 'microsoft-edge'
cask 'microsoft-excel'
cask 'microsoft-auto-update'
cask 'microsoft-powerpoint'
cask 'microsoft-teams'
cask 'microsoft-word'
cask 'minecraft'
cask 'macfuse'
cask 'notion'
cask 'obs'
cask 'rocket'
cask 'sensiblesidebuttons'
cask 'sketch'
cask 'slack'
cask 'steam'
cask 'spotify'
cask 'spotify-now-playing'
cask 'ti-connect-ce'
cask 'tor-browser'
cask 'twitch'
cask 'unity-hub'
cask 'visual-studio-code'
cask 'vlc'
cask 'zotero'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Things', id: 904280696
mas 'Developer', id: 640199958
mas 'Keynote', id: 409183694
mas 'HP Smart', id: 1474276998
mas 'GarageBand', id: 682658836
mas 'GIPHY CAPTURE', id: 668208984
mas 'Numbers', id: 409203825
mas 'Xcode', id: 497799835
mas 'Pages', id: 409201541
mas 'iMovie', id: 408981434
mas 'HazeOver', id: 430798174
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Slack', id: 803453959
mas 'Plash', id: 1494023538