##
# This file installs many apps and tools, as well as some dependencies and drivers.
# 
# This file is organized in the following sections so it's easy to pick and choose sections that you want.
#
# ## Contents
# * Taps: bundle, cask, cask-fonts, cask-versions, cask-drivers
# * Browsers: firefox, google-chrome, microsoft-edge, tor-browser
# * Accounts: 1password, authy
# * Core Utilities: coreutils, pkg-config, tree
# * Utilities: appclearner, flux, HP Smart, macfuse
# * Video/Audio: ffmpeg, GIPHY CAPTURE, obs, twitch
# * Source control: gh, git, github
# * Productivity: alfred, Due, hazeover, notion
# * Office Suite: Keynote, Excel, Powerpoint, Word
# * Programming: arduino, Developer, kite, visual-studio-code
# * Download Managers: adobe-creative-cloud, jetbrains-toolbox
# * Studying: anki
# * Art: clip-studio-paint
# * VPN: cloudflare-warp
# * Cloud Storage: google-backup-and-sync, google-drive, cryptomator
# * Video, audio, and text chat: discord, element, slack, zoom, microsoft-teams
# * Design: figma, sketch
# * Gaming: lunar-client, minecraft, steam
# * Music: GarageBand, spotify
# * Video: twitch, vlc
# * Fonts: lato, open-sans, roboto
# * Journaling: Day One
# * Drivers: silicon-labs-vcp-driver

## Taps
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'nrlquaker/createzap'

brew 'mas'

## Docker
cask 'docker'

## Browsers
cask 'chromium'
cask 'firefox'
cask 'google-chrome'
cask 'microsoft-edge'
cask 'tor-browser'

## Accounts
cask '1password'
cask 'authy'

## Core Utilities
brew 'coreutils'
brew 'curl'
brew 'gcc'
brew 'pkg-config'
brew 'tree'
brew 'wget'

## Utilities
mas 'Amphetamine', id: 937984704
cask 'appcleaner'
cask 'battery-buddy'
cask 'flux'
brew 'gifify'
mas 'HP Smart', id: 1474276998
cask 'macfuse' # Reccomended with Cryptomator
brew 'mackup'
cask 'microsoft-remote-desktop'
cask 'netdownloadhelpercoapp' # Video DownloadHelper Companion App
brew 'node'
brew 'openjdk'
brew 'openjdk@8'
cask 'pictogram'
mas 'Plash', id: 1494023538
cask 'qbittorrent'
cask 'rocket'
cask 'sensiblesidebuttons'
brew 'youtube-dl'

# Terminal
brew 'antigen'
cask 'iterm2'
brew 'zsh'

## Video/Audio
brew 'ffmpeg'
mas 'GIPHY CAPTURE', id: 668208984
mas 'iMovie', id: 408981434
cask 'obs'
cask 'openaudible'
cask 'twitch'
cask 'vlc'

## Source control
brew 'gh'
brew 'git'
cask 'github'

## Productivity
cask 'alfred'
cask "cold-turkey-blocker"
mas 'Due - Reminders & Timers', id: 524373870
cask 'hazeover'
cask 'notion'
mas 'Streaks', id: 1493327990
cask 'thingsmacsandboxhelper'
mas 'Things', id: 904280696
cask 'ti-connect-ce'
cask 'zotero'

## Office Suite
mas 'Keynote', id: 409183694
cask 'microsoft-excel'
cask 'microsoft-powerpoint'
cask 'microsoft-word'
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541

## Programming
cask 'arduino'
mas 'Developer', id: 640199958
mas 'Git Streaks for GitHub', id: 1525795950
cask 'inky'
cask 'kite'
brew 'pipx'
brew 'python3'
mas 'Tomito', id: 1526042938
cask 'visual-studio-code'
mas 'Xcode', id: 497799835

## Download Managers
cask 'adobe-creative-cloud'
cask 'jetbrains-toolbox'
cask 'microsoft-auto-update'
cask 'unity-hub'

## Studying
cask 'anki'

## Art
cask 'adobe-digital-editions'
cask 'clip-studio-paint'
cask 'yacreader'

## VPN
cask 'cloudflare-warp'

## Cloud Storage
cask 'google-backup-and-sync'
cask 'google-drive'
cask 'cryptomator'

## Video, audio, and text chat
cask 'discord'
cask 'element'
cask 'slack'
cask 'microsoft-teams'
cask 'webex'
cask 'zoom'

## Design
cask 'figma'
cask 'sketch'

## Gaming
cask 'lunar-client'
cask 'minecraft'
cask 'shadow'
cask 'steam'

## Music
mas 'GarageBand', id: 682658836
cask 'spotify'

## Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

## Journaling
mas 'Day One', id: 1055511498

## Drivers
cask 'silicon-labs-vcp-driver'