tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "mas"

# Browsers
cask "firefox"

# Files
cask "google-drive"

# Gaming
cask "minecraft"
cask "steam"

# Music
cask "spotify"

# Passwords
cask "1password"

# Productivity
cask "microsoft-word"
mas "Focused Work - Pomodoro Timer", id: 1523968394
mas "Things 3", id: 904280696
cask "thunderbird"

# Learning
cask "anki"

# Programming
cask "github"
cask "visual-studio-code"

# Social
cask "discord"

# Tools
cask "cloudflare-warp"