tap "homebrew/bundle"
brew "ffmpeg"
brew "mas"
cask "1password"
cask "aegisub"
cask "anki"
cask "cloudflare-warp"
cask "discord"
cask "firefox"
cask "github"
cask "google-drive"
cask "handbrake"
cask "inkscape"
cask "microsoft-word"
cask "microsoft-remote-desktop"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
mas "CrystalFetch ISO Downloader", id: 2135503303
mas "Focused Work - Pomodoro Timer", id: 1523968394
mas "Goodnotes 6", id: 1444383602
mas "Things 3", id: 904280696
mas "UTM Virtual Machines", id: 1538878817